#if !defined(VECTORS_H)
#define VECTORS_H

#include <math.h>
#include <limits.h>
#include <float.h>

#define CONCAT_(a, b) a##b
#define CONCAT(a, b) CONCAT_(a, b)
#define STATIC_ASSERT(expr) typedef char CONCAT(static_assert_at_line_, __LINE__)[(expr) ? 1 : -1]

#if !defined(__cplusplus) && !defined(__bool_true_false_are_defined)
    typedef int bool;
    #define true 1
    #define false 0
#endif

#ifndef VECTORS_REAL_TYPE
    #define VECTORS_REAL_TYPE float
#endif
typedef VECTORS_REAL_TYPE real;
STATIC_ASSERT(sizeof(real) == 0x4);

static real real_max(real src0, real src1) { return src0 > src1 ? src0 : src1; }
static real real_min(real src0, real src1) { return src0 < src1 ? src0 : src1; }
static real real_trunc(real src0) { return src0 >= 0 ? (real)floor(src0) : (real)ceil(src0); }

#define VECTORS_PI ((real)3.14159265358979323846)
static const real VECTORS_RAD2DEG = (real)(180.0 / VECTORS_PI);
static const real VECTORS_DEG2RAD = (real)(VECTORS_PI / 180.0);
static const real VECTORS_QUAT_EPSILON = (real)0.0001;

/* Try each unsigned type in order of preference (int first, then long, short, char) */
#if UINT_MAX == 0xFFFFFFFFU
    typedef unsigned int mask_t;
#elif ULONG_MAX == 0xFFFFFFFFUL
    typedef unsigned long mask_t;
#elif USHRT_MAX == 0xFFFFFFFFU
    typedef unsigned short mask_t;
#elif UCHAR_MAX == 0xFFFFFFFFU
    typedef unsigned char mask_t;
#else
    #error "No 32-bit unsigned integer type found"
#endif
STATIC_ASSERT(sizeof(mask_t) == 0x4);

#define X (mask_t)(0)
#define Y (mask_t)(1)
#define Z (mask_t)(2)
#define W (mask_t)(3)

#define MASK_X      (mask_t)(1 << X)
#define MASK_Y      (mask_t)(1 << Y)
#define MASK_Z      (mask_t)(1 << Z)
#define MASK_W      (mask_t)(1 << W)
#define MASK_XY     (mask_t)( MASK_X | MASK_Y )
#define MASK_XZ     (mask_t)( MASK_X | MASK_Z )
#define MASK_XW     (mask_t)( MASK_X | MASK_W )
#define MASK_YZ     (mask_t)( MASK_Y | MASK_Z )
#define MASK_YW     (mask_t)( MASK_Y | MASK_W )
#define MASK_ZW     (mask_t)( MASK_Z | MASK_W )
#define MASK_XYZ    (mask_t)( MASK_X | MASK_Y | MASK_Z )
#define MASK_XYW    (mask_t)( MASK_X | MASK_Y | MASK_W )
#define MASK_XZW    (mask_t)( MASK_X | MASK_Z | MASK_W )
#define MASK_YZW    (mask_t)( MASK_Y | MASK_Z | MASK_W )
#define MASK_XYZW   (mask_t)( MASK_X | MASK_Y | MASK_Z | MASK_W )

#define I X
#define J Y
#define K Z
/* #define W W */

#define MASK_I      MASK_X  
#define MASK_J      MASK_Y  
#define MASK_K      MASK_Z  
/* #define MASK_W      MASK_W */
#define MASK_IJ     MASK_XY 
#define MASK_IK     MASK_XZ 
#define MASK_IW     MASK_XW 
#define MASK_JK     MASK_YZ 
#define MASK_JW     MASK_YW 
#define MASK_KW     MASK_ZW 
#define MASK_IJK    MASK_XYZ
#define MASK_IJW    MASK_XYW
#define MASK_IKW    MASK_XZW
#define MASK_JKW    MASK_YZW
#define MASK_IJKW   MASK_XYZW

#define R X
#define G Y
#define B Z
#define A W

#define MASK_R      MASK_X  
#define MASK_G      MASK_Y  
#define MASK_B      MASK_Z  
#define MASK_A      MASK_W  
#define MASK_RG     MASK_XY 
#define MASK_RB     MASK_XZ 
#define MASK_RA     MASK_XW 
#define MASK_GB     MASK_YZ 
#define MASK_GA     MASK_YW 
#define MASK_BA     MASK_ZW 
#define MASK_RGB    MASK_XYZ
#define MASK_RGA    MASK_XYW
#define MASK_RBA    MASK_XZW
#define MASK_GBA    MASK_YZW
#define MASK_RGBA   MASK_XYZW

#define S X
#define T Y
#define P Z
#define Q W

#define MASK_S      MASK_X  
#define MASK_T      MASK_Y  
#define MASK_P      MASK_Z  
#define MASK_Q      MASK_W  
#define MASK_ST     MASK_XY 
#define MASK_SP     MASK_XZ 
#define MASK_SQ     MASK_XW 
#define MASK_TP     MASK_YZ 
#define MASK_TQ     MASK_YW 
#define MASK_PQ     MASK_ZW 
#define MASK_STP    MASK_XYZ
#define MASK_STQ    MASK_XYW
#define MASK_SPQ    MASK_XZW
#define MASK_TPQ    MASK_YZW
#define MASK_STPQ   MASK_XYZW

/* 2-component realing point vector. */
typedef union vec2
{
    real components[2];
    struct { real x, y; } position;
    struct { real i, j; } rotation;
    struct { real r, g; } color;
    struct { real s, t; } textcoord;
} vec2;
STATIC_ASSERT(sizeof(vec2) == 0x8);

/* 3-component realing point vector. */
typedef union vec3
{
    real components[3];
    struct { real x, y, z; } position;
    struct { real i, j, k; } rotation;
    struct { real r, g, b; } color;
    struct { real s, t, p; } textcoord;
} vec3;
STATIC_ASSERT(sizeof(vec3) == 0xC);

/* 4-component realing point vector. */
typedef union vec4
{
    real components[4];
    struct { real x, y, z, w; } position;
    struct { real i, j, k, w; } rotation;
    struct { real r, g, b, a; } color;
    struct { real s, t, p, q; } textcoord;
} vec4;
STATIC_ASSERT(sizeof(vec4) == 0x10);

/* Swizzle (swap) the order of components */
static vec2 vec2_swizzle(vec2 src0, mask_t a, mask_t b)
{
    vec2 swizzled;
    swizzled.components[0] = src0.components[a & 0x1];
    swizzled.components[1] = src0.components[b & 0x1];
    return swizzled;
}

/* Selects components from src0 if the corresponding bit in the mask is set, otherwise selects from src1. */
static vec2 vec2_mask(vec2 src0, vec2 src1, mask_t mask)
{
    vec2 masked;
    masked.components[0] = mask & MASK_X ? src0.components[0] : src1.components[0];
    masked.components[1] = mask & MASK_Y ? src0.components[1] : src1.components[1];
    return masked;
}

/* Initialize a vec2 from 2 real's, where each component maps to an argument. */
static vec2 vec2_init_from_2(real src0, real src1)
{
    vec2 vector;
    vector.components[0] = src0;
    vector.components[1] = src1;
    return vector;
}

/* Initialize a vec2 from one real, where all components map to the argument. */
